{
  "subAppInfo": [
    {
      "appCode": "calculator",
      "appName": "Calculator",
      "appIconFile": "calculator1_white.png",
      "subAppThumbnailFileName": "calculator.jpg",
      "subAppDescription": "A simple and easy-to-use calculator built with React, allowing you to perform basic mathematical operations like addition, subtraction, multiplication, and division. With an intuitive interface, it enables you to enter numbers, delete digits, and manage operations efficiently.",
      "toolTipInfo": "Built with React using the useReducer hook for state management, this calculator supports basic arithmetic operations (+, -, *, ÷).<br><br>It handles edge cases like overwriting operands, preventing multiple decimal points, and managing input history.<br><br>The app utilizes <i>Intl.NumberFormat</i> for formatted display of large numbers and ensures smooth interaction with a responsive UI.",
      "appUrl": ""
    },
    {
      "appCode": "countryInfo",
      "appName": "Random Country Info",
      "appIconFile": "countries2_white.png",
      "subAppThumbnailFileName": "countryInfo.jpg",
      "subAppDescription": "Get information about a random country using two different APIs, with the second query depending on the information fetched from the first.",
      "toolTipInfo": "Application that randomly selects a country using the npm package random-country.<br><br>With the country code obtained, it fetches the name and flag from the restcountries.com API.<br><br>Then, it uses the common name obtained from this fetch to retrieve additional information from the Wikipedia API.",
      "appUrl": ""
    },
    {
      "appCode": "foodMenuPage",
      "appName": "Menu Picker App",
      "appIconFile": "foodMenu1_white.png",
      "subAppThumbnailFileName": "foodMenuPage.jpg",
      "subAppDescription": "The web application allows employees of a company to place their meal orders for the week. Now, employees can place their orders conveniently from outside the company, streamlining the process and offering greater flexibility.",
      "toolTipInfo": "The application was developed entirely using HTML, CSS, and JavaScript for the frontend, and PHP for the backend, without relying on frameworks. It is responsive, adapting to different devices. The application connects to an internal company database via an ODBC connector. Upon validating the weekly menu selection, an email is automatically sent to the employee with a summary of their selection.",
      "appUrl": ""
    },
    {
      "appCode": "home",
      "appName": "Home",
      "appIconFile": "home1_white.png",
      "subAppThumbnailFileName": "",
      "subAppDescription": "",
      "toolTipInfo": "",
      "appUrl": ""
    },
    {
      "appCode": "hubPage",
      "appName": "Hub Page",
      "appIconFile": "login2_white.png",
      "subAppThumbnailFileName": "hubPage.jpg",
      "subAppDescription": "The web application is a centralized page (hub) that provides access to various applications and schedules, including worker schedules and internal production schedules. It has an access rights management system based on user status, managed by login and password. Additionally, it offers administration functions for CRUD management of users.",
      "toolTipInfo": "The application was developed using HTML, CSS, and JavaScript for the frontend, and PHP for the backend, without relying on frameworks. It is responsive, ensuring an optimal experience regardless of the type of device accessing the application, and features rollback mechanisms to ensure that interrelated operations are completed correctly or, in case of an error, are undone and the user is notified.",
      "appUrl": ""
    },
    {
      "appCode": "itInfrastructureInventory",
      "appName": "IT Inventory App",
      "appIconFile": "switch1_white.png",
      "subAppThumbnailFileName": "itInfrastructureInventory.jpg",
      "subAppDescription": "The application, developed with WinDev, allows the recording and management of all the details of the company's IT infrastructure, including a mapping of the hardware, thus enabling centralized and efficient management of the entire technological infrastructure. It includes information about hardware, users, suppliers, among others.",
      "toolTipInfo": "The application was developed from its inception using WLanguage, covering everything from the design of the Conceptual Data Model (CDM) to the implementation of the HyperFileSQL database. During development, custom global functions were used to manage different types of data, providing the project with excellent maintainability, scalability, and modularity. These practices enabled a flexible design that can easily adapt to future expansions and modifications, ensuring a robust structure that is easy to maintain in the long term.",
      "appUrl": ""
    },
    {
      "appCode": "survey",
      "appName": "Survey",
      "appIconFile": "survey2_white.png",
      "subAppThumbnailFileName": "survey.jpg",
      "subAppDescription": "This web app features a quiz where users are shown a photo of a member of the Felidae family and must select the correct species from a list of options. Whether it's a lion, tiger, leopard, or a domestic cat, the user’s task is to match the animal to its species. It’s a fun and interactive way to learn about these fascinating animals and sharpen your recognition skills!",
      "toolTipInfo": "The survey is based on information and images taken from Wikipedia.<br><br>It consists of a random selection of 10 images, where the user must correctly identify the species shown.<br><br>In case of failure, a hint will be randomly given and displayed to the user to help them with their answer.",
      "appUrl": ""
    },
    {
      "appCode": "wordle",
      "appName": "Wordle",
      "appIconFile": "wordle1_white.png",
      "subAppThumbnailFileName": "wordle.jpg",
      "subAppDescription": "The Wordle game app presents a word challenge where players must guess a word in six attempts, receiving clues about the correct letters and their positions, promoting strategic thinking.",
      "toolTipInfo": "Wordle challenges players to guess a hidden 5-letter word in 6 attempts.<br><br>Users can input letters using the PC or mobile keyboard, or a virtual keyboard.<br><br>With each attempt, the boxes display a yellow background for letters that are in the word but not in the correct position, and green for letters that are in the correct position.",
      "appUrl": ""
    }
  ],
  "footer": "All rights reserved.",
  "amazonScraper": {},
  "calculator": {},
  "countryInfo": {
    "newCountryButton": "New country",
    "emptyCode": "Country code not assigned",
    "countryNotFound": "Country not found",
    "wikiInfoNotFound": "Wikipedia info not found",
    "countryCode": "Country code",
    "loading": "Loading...",
    "weather": {
      "0": "Clear Sky",
      "1": "Mainly Clear",
      "2": "Partly Cloudy",
      "3": "Overcast",
      "45": "Fog",
      "48": "Depositing Rime Fog",
      "51": "Light Drizzle",
      "53": "Moderate Drizzle",
      "55": "Dense Drizzle",
      "56": "Light Freezing Drizzle",
      "57": "Dense Freezing Drizzle",
      "61": "Slight Rain",
      "63": "Moderate Rain",
      "65": "Heavy Rain",
      "66": "Light Freezing Rain",
      "67": "Heavy Freezing Rain",
      "71": "Slight Snow Fall",
      "73": "Moderate Snow Fall",
      "75": "Heavy Snow Fall",
      "77": "Snow grains",
      "80": "Slight Rain Showers",
      "81": "Moderate Rain Showers",
      "82": "Violent Rain Showers",
      "85": "Slight Snow Showers",
      "86": "Heavy Snow Showers",
      "95": "Thunderstorm",
      "96": "Thunderstorm with slight hail",
      "99": "Thunderstorm with heavy hail"
    }
  },
  "eshop": {},
  "foodMenuPage": {

  },
  "hangman": {},
  "home": {
    "jobTitle": "Full Stack Developer",
    "userDescription": "With two years of experience, I have led three solutions from their design to their deployment and have completed several personal projects using React and Node.js. I have strong skills in JavaScript, HTML5, CSS, PHP, Git/GitHub, SQL, and PL/SQL, as well as a proven ability to transform user needs into effective web solutions. Always eager to learn, I quickly adapt to new technologies and challenges. On this site, you can explore some of my personal projects.",
    "projects": "Projects"
  },
  "hubPage": {

  },
  "itInfrastructureInventory": {

  },
  "mineSweeper": {},
  "survey": {
    "backToSurveyMain": "Back to Menu",
    "clueTitle": "Clues",
    "mainPageTitle": "Learn about felines",
    "nextQuestion": "Next Question",
    "noAnswerMessage": "Find the correct answer before proceeding to the next question.",
    "phylogeneticTree": "Phylogenetic tree",
    "phylogeneticTreeMessage": "Click on the image of each species to learn more about it.",
    "prepareSurvey": "Meet the Felines",
    "question": "Who am I?",
    "quitSurvey": "Quit survey",
    "results": "Results",
    "resultsMessage": {
      "good": "Congratulations! You answered all the questions about felines correctly. The feline world holds no mysteries for you!",
      "medium": "Good job! You answered many questions correctly, but there are still some areas to improve. Keep practicing, and you'll master the world of felines!",
      "bad": "Don't worry! Although the result wasn't what you hoped for, you have the chance to learn and improve. Review the material, and you'll be much more prepared next time. You can do it!"
    },
    "resultsScore1": "You scored",
    "resultsScore2": "points out of a total of 30.",
    "scoreExplanation": "The scoring for the test is as follows:<br><br><ul><li>3 points for each answer with no mistakes.</li><li>2 points for each answer correct with 1 mistake.</li><li>1 point for each answer correct with 2 mistakes.</li><li>0 points if the answer has 3 mistakes.</li></ul>",
    "scoreExplanationTitle": "Scoring Guide",
    "startSurvey": "Start the Survey",
    "species": {
      "caracal": {
        "name": "Caracal",
        "binomialNomenclature": "Caracal caracal",
        "info": "The caracal (<i>Caracal caracal</i>) is a medium-sized wild cat native to Africa, the Middle East, Central Asia, and arid areas of Pakistan and northwestern India. It is characterised by a robust build, long legs, a short face, long tufted ears, relatively short tail, and long canine teeth.<br><br>Its coat is uniformly reddish tan or sandy, while the ventral parts are lighter with small reddish markings. It is a medium-sized cat (between 60 and 92 cm (1 ft 11.5 in – 3 ft) in length, excluding the tail) and weighs 8–19 kg (18–42 lb). The caracal is <strong>sometimes called the \"African lynx\"</strong>, but it is not closely related to lynxes, and seems to be more closely related to the serval.",
        "clues": [
          "Native to Africa, the Middle East, Central Asia, and arid regions of Pakistan and northwestern India.",
          "Medium-sized cat, measuring between 60 and 92 cm (1 ft 11.5 in – 3 ft) in length, excluding the tail, and weighing between 8 and 19 kg (18–42 lb).",
          "Sometimes called the \"African lynx\"."
        ]
      },
      "cat": {
        "name": "Cat",
        "binomialNomenclature": "Felis catus",
        "info": "The cat (<i>Felis catus</i>), also referred to as domestic cat or house cat, is a small domesticated carnivorous mammal. It is the <strong>only domesticated species of the family Felidae</strong>.<br><br>Advances in archaeology and genetics have shown that the domestication of the cat occurred in the Near East around 7500 BC. Cat communication includes vocalizations—including meowing, purring, trilling, hissing, growling, and grunting–as well as body language.<br><br>It averages about 46 cm (18 in) in head-to-body length and 23–25 cm (9.1–9.8 in) in height, with about 30 cm (12 in) long tails. Adult domestic cats typically weigh 4–5 kg (8.8–11.0 lb).",
        "clues": [
          "The only domesticated species in the Felidae family.",
          "Capable of communicating through meowing, purring, trilling, hissing, growling, and grunting.",
          "Typically weighs between 4 and 5 kg (8.8–11.0 lb)."
        ]
      },
      "cheetah": {
        "name": "Cheetah",
        "binomialNomenclature": "Acinonyx jubatus",
        "info": "The cheetah (<i>Acinonyx jubatus</i>) is a large cat and the <strong>fastest land animal</strong>. It has a tawny to creamy white or pale buff fur that is marked with evenly spaced, solid black spots (<span class='species-spot-pattern'>further information</span>).<br><br>The head is small and rounded, with a short snout and black tear-like facial streaks. It reaches 67–94 cm (26–37 in) at the shoulder, and the head-and-body length is between 1.1 and 1.5 m (3 ft 7 in and 4 ft 11 in). Adults weigh between 21 and 72 kg (46 and 159 lb). The cheetah is capable of running at 93 to 104 km/h (58 to 65 mph); it has evolved specialized adaptations for speed, including a light build, long thin legs and a long tail.<br><br>Currently found mainly in small, fragmented populations in northwestern, eastern, and southern Africa, as well as central Iran.",
        "clues": [
          "The fastest land animal, capable of reaching speeds of 93 to 104 km/h (58 to 65 mph).",
          "Small, rounded head with a short snout and distinctive black tear-like facial streaks.",
          "Found mainly in northwestern, eastern, and southern Africa, as well as central Iran."
        ]
      },
      "cloudedLeopard": {
        "name": "Clouded Leopard",
        "binomialNomenclature": "Neofelis nebulosa",
        "info": "The clouded leopard (<i>Neofelis nebulosa</i>), also called mainland clouded leopard, is a wild cat inhabiting dense forests from the foothills of the Himalayas through Northeast India and Bhutan to mainland Southeast Asia into South China.<br><br>The clouded leopard has large dusky-grey blotches and irregular spots and stripes reminiscent of clouds. Its head-and-body length ranges from 68.6 to 108 cm (27.0 to 42.5 in) with a 61 to 91 cm (24 to 36 in) long tail.<br><br>It uses its tail for balancing when moving in trees and is able to climb down vertical tree trunks head first. It rests in trees during the day and hunts by night on the forest floor.",
        "clues": [
          "Inhabits dense forests from the Himalayan foothills through Northeast India and Bhutan to mainland Southeast Asia and southern China.",
          "Displays large dusky-grey blotches with irregular cloud-like spots and stripes.",
          "Rests in trees by day and hunts on the forest floor at night."
        ]
      },
      "cougar": {
        "name": "Cougar",
        "binomialNomenclature": "Puma concolor",
        "info": "The cougar (<i>Puma concolor</i>), also known as the panther, mountain lion, catamount, and puma, is a large cat native to the Americas. It inhabits North, Central, and South America, making it the most widely distributed wild terrestrial mammal in the Western Hemisphere.<br><br>They are the <strong>fourth-largest cat species worldwide</strong>; adults stand about 60 to 90 cm (24 to 35 in) tall at the shoulders. Adult ranges between 1.50 to 2.75 m (4 ft 11 in to 9 ft 0 in) nose to tail. Adults generally weigh 34 to 72 kg (75 to 159 lb).",
        "clues": [
          "Native to the Americas, found across a wide range in North, Central, and South America.",
          "The fourth-largest wild cat species in the world.",
          "Also known as the mountain lion."
        ]
      },
      "jaguar": {
        "name": "Jaguar",
        "binomialNomenclature": "Panthera onca",
        "info": "The jaguar (<i>Panthera onca</i>) is a large cat species and the only living member of the genus Panthera that is native to the Americas. With a body length of up to 1.85 m (6 ft 1 in) and a weight of up to 158 kg (348 lb), it is the biggest cat species in the Americas and the <strong>third-largest in the world</strong>.<br><br>Its distinctively marked coat features pale yellow to tan colored fur covered by spots that transition to rosettes (<span class='species-spot-pattern'>further information</span>) on the sides, although a <strong>melanistic black coat</strong> appears in some individuals. The spots and their shapes vary: on the sides, they become rosettes which may include one or several dots.",
        "clues": [
          "The largest cat in the Americas and the third-largest in the world.",
          "Features distinctive spots and rosettes.",
          "A melanistic black coat can appear in some individuals."
        ]
      },
      "leopard": {
        "name": "Leopard",
        "binomialNomenclature": "Panthera pardus",
        "info": "The leopard (<i>Panthera pardus</i>) is one of the five extant species in the genus Panthera. Its body is slender and muscular reaching a length of 92–183 cm (36–72 in) with a 66–102 cm (26–40 in) long tail. Males typically weigh 30.9–72 kg (68–159 lb), and females 20.5–43 kg (45–95 lb).<br><br>It has pale yellowish to dark golden fur with dark spots grouped in rosettes. The leopard's rosettes differ from those of the jaguar (<span class='species-spot-pattern'>further information</span>), which are darker and with smaller spots inside.<br><br><strong>Melanistic leopards</strong> are also known as black panthers. Compared to other wild cats, the leopard has relatively short legs and a long body with a large skull.",
        "clues": [
          "Slender, muscular build with short legs and a long body, featuring a large skull.",
          "Distinctive rosette-patterned coat.",
          "Its melanistic form known as the \"black panther\"."
        ]
      },
      "lion": {
        "name": "Lion",
        "binomialNomenclature": "Panthera leo",
        "info": "The lion (<i>Panthera leo</i>) is a large cat of the genus Panthera, native to Africa and India. It has a muscular, broad-chested body; a short, rounded head; round ears; and a dark, hairy tuft at the tip of its tail. The lion inhabits grasslands, savannahs, and shrublands.<br><br>During the Neolithic period, the lion ranged throughout Africa and Eurasia, from Southeast Europe to India, but it has been reduced to fragmented populations in sub-Saharan Africa and one population in western India.<br><br>Among felids, the lion is <strong>second only to the tiger in size</strong>. The natural weight of adult lions generally ranges between 120-190 kg (264 – 419 lb), and their size ranges from 158 to 250 cm (5 ft 2 in – 8 ft 2 in) in length from the muzzle to the base of the tail, with an average tail length of 90 cm (2 ft 11 in).",
        "clues": [
          "Muscular build with a broad chest and a distinctive mane in males.",
          "Native to Africa and India, found in savannas and grasslands.",
          "The second-largest feline species."
        ]
      },
      "lynx": {
        "name": "Lynx",
        "binomialNomenclature": "Lynx",
        "info": "A lynx is any of the four extant species (the Canada lynx, Iberian lynx, Eurasian lynx, and the bobcat) within the medium-sized wild cat genus Lynx.<br><br>Lynx have a short tail, characteristic tufts of black hair on the tips of their ears, large, padded paws for walking on snow, and long whiskers on the face. Their body color varies from medium brown to goldish to beige-white, and is occasionally marked with dark brown spots, especially on the limbs.<br><br>Their weight ranges from 7.3 to 30 kg (16 to 66 lb) and length from 71 to 129 cm (28 to 51 in). All species are found exclusively in the Northern Hemisphere, across Eurasia and North America.",
        "clues": [
          "Characteristic tufts of black hair on the tips of their ears.",
          "Medium-sized wild cats, with a range of fur colorations and occasional spotting.",
          "Found exclusively in the Northern Hemisphere, across Eurasia and North America."
        ]
      },
      "ocelot": {
        "name": "Ocelot",
        "binomialNomenclature": "Leopardus pardalis",
        "info": "The ocelot (<i>Leopardus pardalis</i>) is a medium-sized spotted wild cat that reaches 40–50 cm (16–20 in) at the shoulders and weighs between 7 and 15.5 kg (15 and 34 lb) on average.<br><br>It is native to the southwestern United States, Mexico, Central and South America, and the Caribbean islands of Trinidad and Margarita.<br><br>The ocelot's fur is extensively marked with solid black markings on a creamy, tawny, yellowish, reddish-gray, or gray background color. The spots on the head and limbs are small, but markings on the back, cheeks, and flanks are open or closed bands and stripes. The ocelot is the <strong>largest member of the genus Leopardus</strong>.",
        "clues": [
          "Medium-sized wild cat with a distinctive coat pattern, featuring solid black markings and spots.",
          "Found in the Americas, including the southwestern U.S. and parts of Central and South America.",
          "The largest member of the genus Leopardus."
        ]
      },
      "serval": {
        "name": "Serval",
        "binomialNomenclature": "Leptailurus serval",
        "info": "The serval (<i>Leptailurus serval</i>) is a wild cat native to Africa. It is widespread in sub-Saharan countries, except in rainforest regions.<br><br>The serval is a slender, medium-sized cat that stands 54–62 cm (21–24 in) at the shoulder and weighs 9–18 kg (20–40 lb). It is characterized by a small head, large ears, a golden-yellow to buff coat spotted and striped with black, and a short, black-tipped tail.<br><br>The serval has the <strong>longest legs of any cat relative to its body size</strong>. The serval is similar to the sympatric caracal, but has a narrower spoor, a rounder skull, and lacks its prominent ear tufts.",
        "clues": [
          "Wild cat native to Africa.",
          "Has the longest legs of any cat relative to its body size.",
          "Similar to the sympatric caracal, but with a narrower spoor, a rounder skull, and lacking prominent ear tufts."
        ]
      },
      "snowLeopard": {
        "name": "Snow Leopard",
        "binomialNomenclature": "Panthera uncia",
        "info": "The snow leopard (<i>Panthera uncia</i>) is a species of large cat in the genus Panthera of the family Felidae. The species is native to the mountain ranges of Central and South Asia.<br><br>The snow leopard's fur is whitish to grey with black spots on the head and neck, with larger rosettes on the back, flanks, and bushy tail.<br><br>Its muzzle is short, its forehead domed, and its nasal cavities are large. They are stocky, short-legged, and slightly smaller than other cats of the genus Panthera, ranging in head-to-body size from 75 to 150 cm (30 to 59 in). Its tail is 80 to 105 cm (31 to 41 in) long. Its weight ranges from 25 kg (55 lb) to 75 kg (165 lb).",
        "clues": [
          "Stocky build with short legs, large nasal cavities, and a short muzzle.",
          "Whitish to grey coat with distinctive black spots and rosettes.",
          "Native to the mountain ranges of Central and South Asia."
        ]
      },
      "tiger": {
        "name": "Tiger",
        "binomialNomenclature": "Panthera tigris",
        "info": "The tiger (<i>Panthera tigris</i>) is a large cat and a member of the genus Panthera native to Asia. It has a powerful, muscular body with a large head and paws, a long tail, and orange fur with black, mostly vertical stripes.<br><br>It is the <strong>largest cat species in the world</strong>, along with the lion, and both species can reach sizes comparable to the largest fossil cats. However, tiger measurements vary greatly between subspecies: a male Sumatran tiger may weigh up to 140 kg (308 lb) and reach a length of 2.3 meters (7 ft 6.5 in), while a Siberian tiger can weigh up to 300 kg (661 lb) and reach lengths of 3.3 meters (10 ft 10 in).",
        "clues": [
          "The largest cat species in the world.",
          "Powerful, muscular body with large paws, a long tail, and orange fur with black stripes.",
          "Size and weight vary significantly among subspecies."
        ]
      }
    }
  },
  "tictactoe": {},
  "virtualDice": {},
  "wordle": {
    "newGame": "New game",
    "keyboardLanguageError": "Keyboard language coudn't be charged for language code",
    "openVirtualKeyboard": "Open virtual keyboard",
    "closeVirtualKeyboard": "Close virtual keyboard",
    "incorrectLengthMessage": "Not enough letters",
    "wordNotFoundMessage": "Not in word list",
    "defeatMessage": "Sorry, you didn't guess the word. The word was:",
    "victoryMessage": "Congratulations! You've guessed the word:"
  }
}