{
  "subAppInfo": [
    {
      "appCode": "calculator",
      "appName": "Calculadora",
      "appIconFile": "calculator1_white.png",
      "subAppThumbnailFileName": "calculator.jpg",
      "subAppDescription": "Una calculadora sencilla y fácil de usar, construida con React, que permite realizar operaciones matemáticas básicas como suma, resta, multiplicación y división. Con una interfaz intuitiva, permite ingresar números, eliminar dígitos, y manejar operaciones de manera eficiente.",
      "toolTipInfo": "Construida con React utilizando el hook useReducer para la gestión del estado, esta calculadora admite operaciones aritméticas básicas (+, -, *, ÷).<br><br>Maneja casos especiales como la sobreescritura de operandos, la prevención de puntos decimales múltiples y la gestión del historial de entradas.<br><br>La aplicación utiliza <i>Intl.NumberFormat</i> para mostrar números grandes de forma formateada y garantiza una interacción fluida con una interfaz de usuario receptiva.",
      "appUrl": ""
    },
    {
      "appCode": "countryInfo",
      "appName": "Información de país al azar",
      "appIconFile": "countries2_white.png",
      "subAppThumbnailFileName": "countryInfo.jpg",
      "subAppDescription": "Obtén información sobre un país aleatorio utilizando dos APIs diferentes, siendo la segunda consulta dependiente de la información obtenida de la primera.",
      "toolTipInfo": "Aplicación que selecciona un país al azar utilizando el paquete npm random-country.<br><br>Con el código del país obtenido, se busca su nombre y bandera en la API de restcountries.com.<br><br>Luego, se utiliza el nombre común obtenido de este fetch para buscar información adicional en la API de Wikipedia.",
      "emptyCode": "Código de país no asignado",
      "countryNotFound": "País no encontrado",
      "wikiInfoNotFound": "Información de Wikipedia no encontrada",
      "countryCode": "Código del país",
      "loading": "Cargando...",
      "weather": {
        "0": "Cielo Despejado",
        "1": "Principalmente Despejado",
        "2": "Parcialmente Nublado",
        "3": "Cubierto",
        "45": "Niebla",
        "48": "Niebla con Deposición de Escarcha",
        "51": "Lluvia Ligera",
        "53": "Lluvia Moderada",
        "55": "Lluvia Densa",
        "56": "Lluvia Ligera Congelada",
        "57": "Lluvia Congelada Densa",
        "61": "Lluvia Ligera",
        "63": "Lluvia Moderada",
        "65": "Lluvia Fuerte",
        "66": "Lluvia Congelada Ligera",
        "67": "Lluvia Congelada Fuerte",
        "71": "Nevada Ligera",
        "73": "Nevada Moderada",
        "75": "Nevada Fuerte",
        "77": "Granos de Nieve",
        "80": "Lluvias Ligeras",
        "81": "Lluvias Moderadas",
        "82": "Lluvias Fuertes",
        "85": "Nevadas Ligeras",
        "86": "Nevadas Fuertes",
        "95": "Tormenta Eléctrica",
        "96": "Tormenta Eléctrica con Granizo Ligero",
        "99": "Tormenta Eléctrica con Granizo Fuerte"
      },
      "appUrl": ""
    },
    {
      "appCode": "home",
      "appName": "Inicio",
      "appIconFile": "home1_white.png",
      "subAppThumbnailFileName": "",
      "subAppDescription": "",
      "toolTipInfo": "",
      "appUrl": ""
    },
    {
      "appCode": "survey",
      "appName": "Cuestionario",
      "appIconFile": "survey2_white.png",
      "subAppThumbnailFileName": "survey.jpg",
      "subAppDescription": "Esta aplicación web presenta un cuestionario en el que el usuario ve una foto de un miembro de la familia Felidae y debe seleccionar la especie correcta de entre varias opciones. Ya sea un león, un tigre, un leopardo o un gato doméstico, la tarea del usuario es asociar el animal con su especie. Es una forma divertida e interactiva de aprender sobre estos animales fascinantes y mejorar tus habilidades de reconocimiento.",
      "toolTipInfo": "El cuestionario está basado en información e imágenes extraídas de Wikipedia.<br><br>Consiste en un sorteo aleatorio de 10 imágenes, en las cuales el usuario debe identificar correctamente la especie que se muestra.<br><br>En caso de no acertar, se proporcionará una pista de forma aleatoria que será mostrada al usuario para ayudarle en su respuesta.",
      "appUrl": ""
    },
    {
      "appCode": "wordle",
      "appName": "Wordle",
      "appIconFile": "wordle1_white.png",
      "subAppThumbnailFileName": "wordle.jpg",
      "subAppDescription": "La aplicación del juego \"Wordle\" propone un desafío de palabras donde los jugadores deben adivinar una palabra en seis intentos, recibiendo pistas sobre las letras correctas y su posición, favoreciendo la reflexión estratégica.",
      "toolTipInfo": "Wordle desafía a los jugadores a adivinar una palabra oculta de 5 letras (sin acentos) en 6 intentos.<br><br>Los usuarios pueden escribir letras utilizando el teclado del PC o móvil, o con un teclado virtual.<br><br>En cada intento, las casillas muestran un fondo amarillo para las letras que están en la palabra pero no en la posición correcta, y verde para las letras que están en la posición correcta.",
      "newGame": "Nueva partida",
      "keyboardLanguageError": "No se pudo cargar el idioma del teclado para el código de idioma",
      "openVirtualKeyboard": "Abrir teclado virtual",
      "closeVirtualKeyboard": "Cerrar teclado virtual",
      "incorrectLengthMessage": "Escriba una palabra de 5 letras",
      "wordNotFoundMessage": "La palabra no está en la lista de palabras posibles",
      "defeatMessage": "Lo siento, no has adivinado la palabra. La palabra era:",
      "victoryMessage": "¡Felicidades! Has adivinado la palabra:",
      "appUrl": ""
    }
  ],
  "footer": "Todos los derechos reservados.",
  "amazonScraper": {},
  "calculator": {},
  "countryInfo": {
    "newCountryButton": "Nuevo país"
  },
  "eshop": {},
  "hangman": {},
  "home": {
    "jobTitle": "Desarrollador Full Stack",
    "userDescription": "Mi objetivo es especializarme en el desarrollo web, especialmente con React y Node.js. Como desarrollador web, he llevado a cabo tres proyectos profesionales, desde su concepción hasta su despliegue, y he realizado varios proyectos personales con React.js. Poseo sólidos conocimientos en JavaScript, HTML, CSS, PHP, Git/GitHub, SQL y PL/SQL, además de la capacidad de transformar las necesidades de los usuarios en soluciones web concretas. En este sitio, podrás explorar algunos de mis proyectos personales.",
    "projects": "Proyectos"
  },
  "mineSweeper": {},
  "survey": {
    "backToSurveyMain": "Volver al Menú",
    "clueTitle": "Pistas",
    "mainPageTitle": "Aprende sobre los felinos",
    "nextQuestion": "Siguiente pregunta",
    "noAnswerMessage": "Encuentra la respuesta correcta antes de pasar a la siguiente pregunta.",
    "phylogeneticTree": "Árbol filogenético",
    "phylogeneticTreeMessage": "Haz clic sobre la imagen de cada especie para obtener más información sobre ella.",
    "prepareSurvey": "Conoce a los felinos",
    "question": "¿Quién soy?",
    "quitSurvey": "Salir del cuestionario",
    "results": "Resultados",
    "resultsMessage": {
      "good": "¡Felicidades! Has acertado todas las preguntas sobre felinos correctamente. ¡El mundo felino no tiene misterios para ti!",
      "medium": "¡Buen trabajo! Has respondido correctamente a muchas preguntas, pero aún hay algunas áreas en las que puedes mejorar. ¡Sigue practicando y dominarás el mundo de los felinos!",
      "bad": "¡No te preocupes! Aunque el resultado no fue el esperado, tienes la oportunidad de aprender y mejorar. Repasa el material y estarás mucho más preparado la próxima vez. ¡Tú puedes!"
    },
    "resultsScore1": "Has obtenido",
    "resultsScore2": "puntos sobre un total de 30.",
    "scoreExplanation": "La puntuación del test se otorga de la siguiente manera:<br><br><ul><li>3 puntos por cada respuesta correcta sin errores.</li><li>2 puntos por cada respuesta correcta con 1 error.</li><li>1 punto por cada respuesta correcta con 2 errores.</li><li>0 puntos si la respuesta tiene 3 errores.</ul>",
    "scoreExplanationTitle": "Guía de Puntuación",
    "startSurvey": "Comenzar el cuestionario",
    "species": {
      "caracal": {
        "name": "Caracal",
        "binomialNomenclature": "Caracal caracal",
        "info": "El caracal (<i>Caracal caracal</i>) es un felino salvaje de tamaño medio originario de África, el Medio Oriente, Asia Central y áreas áridas de Pakistán y el noroeste de la India. Se caracteriza por una constitución robusta, patas largas, rostro corto, orejas largas y con penachos, cola relativamente corta y dientes caninos largos.<br><br>Su pelaje es de color rojo oscuro o arenoso uniforme, mientras que las partes ventrales son más claras con pequeñas marcas rojizas. Es un felino de tamaño medio (entre 60 y 92 cm (1 pie 11.5 pulgadas – 3 pies) de largo, sin incluir la cola) y pesa entre 8 y 19 kg (18–42 lb). <strong>A veces se le llama \"lince africano\"</strong>, pero no está estrechamente relacionado con los linces, y parece estar más estrechamente relacionado con el serval.",
        "clues": [
          "Originario de África, Oriente Medio, Asia Central y áreas áridas de Pakistán y el noroeste de la India.",
          "Felino de tamaño medio, con una longitud entre 60 y 92 cm (1 pie 11.5 pulgadas – 3 pies) sin contar la cola, y un peso entre 8 y 19 kg (18–42 lb).",
          "A veces se le llama \"lince africano\""
        ]
      },
      "cat": {
        "name": "Gato doméstico",
        "binomialNomenclature": "Felis catus",
        "info": "El gato (<i>Felis catus</i>), también conocido como gato doméstico, es un mamífero carnívoro pequeño y domesticado. Es la <strong>única especie domesticada de la familia Felidae</strong>.<br><br>Los avances en arqueología y genética han mostrado que la domesticación del gato ocurrió en el Cercano Oriente alrededor del 7500 a.C. La comunicación de los gatos incluye vocalizaciones —como maullidos, ronroneos, trinos, silbidos, gruñidos y gemidos— así como el lenguaje corporal.<br><br>Su longitud promedio de cabeza a cuerpo es de unos 46 cm (18 in) y una altura de 23 a 25 cm (9.1–9.8 in), con una cola de unos 30 cm (12 in). Los gatos domésticos adultos suelen pesar entre 4 y 5 kg (8.8–11.0 lb).",
        "clues": [
          "La única especie domesticada de la familia de los felinos.",
          "Capaz de comunicarse mediante maullidos, ronroneos, trinos, silbidos, gruñidos y resoplidos.",
          "Generalmente pesa entre 4 y 5 kg (8.8–11.0 lb)."
        ]
      },
      "cheetah": {
        "name": "Guepardo",
        "binomialNomenclature": "Acinonyx jubatus",
        "info": "El guepardo (<i>Acinonyx jubatus</i>) es un gran felino y el <strong>animal terrestre más rápido</strong>. Tiene un pelaje que varía de color leonado a blanco cremoso o buff pálido, marcado con manchas negras distribuidas uniformemente (<span class='species-spot-pattern'>más información</span>).<br><br>La cabeza es pequeña y redondeada, con un hocico corto y marcas faciales negras en forma de lágrima. Alcanza de 67 a 94 cm (26–37 in) de altura en los hombros, y su longitud total de cuerpo es entre 1.1 y 1.5 m (3 pies 7 in y 4 pies 11 in). Los adultos pesan entre 21 y 72 kg (46–159 lb). El guepardo es capaz de correr a 93 a 104 km/h (58–65 mph); ha evolucionado con adaptaciones especializadas para la velocidad, como una estructura ligera, piernas largas y finas, y una cola larga.<br><br>Actualmente distribuido principalmente en pequeñas poblaciones fragmentadas en el noroeste, este y sur de África, así como en el centro de Irán.",
        "clues": [
          "El animal terrestre más rápido, capaz de alcanzar velocidades de 93 a 104 km/h (58 a 65 mph).",
          "Cabeza pequeña y redondeada, con un hocico corto y marcas faciales negras similares a lágrimas.",
          "Se encuentra principalmente en el noroeste, este y sur de África, así como en el centro de Irán."
        ]
      },
      "cloudedLeopard": {
        "name": "Pantera Nebulosa",
        "binomialNomenclature": "Neofelis nebulosa",
        "info": "La pantera nebulosa (<i>Neofelis nebulosa</i>), también llamado leopardo longibando, es un felino salvaje que habita en bosques densos desde las estribaciones del Himalaya a través del noreste de India y Bután hasta el sudeste asiático continental y el sur de China.<br><br>El leopardo nebuloso tiene grandes manchas grisáceas oscuras y manchas y rayas irregulares que recuerdan a las nubes. Su longitud de cabeza y cuerpo varía de 68.6 a 108 cm (27.0 a 42.5 pulgadas) con una cola de 61 a 91 cm (24 a 36 pulgadas) de largo.<br><br>Utiliza su cola para equilibrarse al moverse entre los árboles y es capaz de bajar troncos verticales cabeza abajo. Descansa en los árboles durante el día y caza de noche en el suelo del bosque.",
        "clues": [
          "Habita en bosques densos desde las estribaciones del Himalaya, pasando por el noreste de la India y Bután, hasta el sudeste asiático continental y el sur de China.",
          "Posee grandes manchas gris oscuro con patrones irregulares y rayas que recuerdan a las nubes.",
          "Descansa en los árboles durante el día y caza en el suelo del bosque por la noche."
        ]
      },
      "cougar": {
        "name": "Puma",
        "binomialNomenclature": "Puma concolor",
        "info": "El puma (<i>Puma concolor</i>), también conocido como león de montaña y león americano, es un gran felino originario de las Américas. Habita en América del Norte, Central y del Sur, lo que lo convierte en el mamífero terrestre salvaje más ampliamente distribuido en el hemisferio occidental.<br><br>Es el <strong>cuarto felino más grande del mundo</strong>; los adultos miden entre 60 y 90 cm (24 a 35 in) de altura en los hombros. La longitud total del cuerpo de los adultos varía entre 1,50 y 2,75 m (4 pies 11 in a 9 pies 0 in). El peso de los adultos generalmente varía entre 34 y 72 kg (75 a 159 lb).",
        "clues": [
          "Originario de las Américas, se encuentra en una amplia área que abarca América del Norte, Central y del Sur.",
          "Cuarta especie de felino salvaje más grande del mundo.",
          "También conocido como león de montaña."
        ]
      },
      "jaguar": {
        "name": "Jaguar",
        "binomialNomenclature": "Panthera onca",
        "info": "El jaguar (<i>Panthera onca</i>) es una especie de felino grande y el único miembro vivo del género Panthera que es originario de las Américas. Con una longitud corporal de hasta 1,85 m (6 pies 1 in) y un peso de hasta 158 kg (348 lb), es el felino más grande de las Américas y el <strong>tercero más grande del mundo</strong>.<br><br>Su pelaje distintivo tiene un color de fondo amarillo pálido a fawn, cubierto de manchas que se transforman en rosetas (<span class='species-spot-pattern'>más información</span>) a los lados, aunque algunos individuos presentan un <span class='melanistic'>pelaje negro melanístico</span>. Las manchas y sus formas varían: en los costados, se convierten en rosetas que pueden incluir uno o varios puntos.",
        "clues": [
          "El felino más grande de las Américas y el tercero más grande del mundo.",
          "Presenta manchas y rosetas distintivas.",
          "Un pelaje negro melanístico puede aparecer en algunos individuos."
        ]
      },
      "leopard": {
        "name": "Leopardo",
        "binomialNomenclature": "Panthera pardus",
        "info": "El leopardo (<i>Panthera pardus</i>) es una de las cinco especies vivas en el género Panthera. Su cuerpo es esbelto y muscular, alcanzando una longitud de 92–183 cm (36–72 in) con una cola de 66–102 cm (26–40 in) de largo. Los machos pesan típicamente entre 30,9–72 kg (68–159 lb), y las hembras entre 20,5–43 kg (45–95 lb).<br><br>Tiene un pelaje de color amarillo pálido a dorado oscuro con manchas oscuras agrupadas en rosetas. Las rosetas del leopardo se diferencian de las del jaguar (<span class='species-spot-pattern'>más información</span>), que son más oscuras y con manchas más pequeñas dentro.<br><br>Los <strong>leopardos melanísticos</strong> también son conocidos como panteras negras. Comparado con otros felinos salvajes, el leopardo tiene patas relativamente cortas y un cuerpo largo con un cráneo grande.",
        "clues": [
          "Cuerpo esbelto y musculoso con patas cortas y cuerpo largo, con un cráneo grande.",
          "Pelaje característico con patrón de rosetas.",
          "Su forma melanística es conocida como la \"pantera negra\"."
        ]
      },
      "lion": {
        "name": "León",
        "binomialNomenclature": "Panthera leo",
        "info": "El león (<i>Panthera leo</i>) es un gran felino del género Panthera, originario de África e India. Tiene un cuerpo musculoso y de pecho ancho; una cabeza corta y redonda; orejas redondas; y una pequeña melena oscura en la punta de su cola. El león habita en praderas, sabanas y arbustos.<br><br>Durante el período neolítico, el león estaba presente en toda África y Eurasia, desde el sureste de Europa hasta la India, pero se ha reducido a poblaciones fragmentadas en el África subsahariana y una población en el oeste de la India.<br><br>Entre los felinos, el león es el <strong>segundo más grande después del tigre</strong>. El peso natural de los leones adultos generalmente varía entre 120–190 kg (264–419 lb), y su tamaño va de 158 a 250 cm (5 pies 2 in – 8 pies 2 in) de largo, desde el hocico hasta la base de la cola, con una longitud media de la cola de 90 cm (2 pies 11 in).",
        "clues": [
          "Cuerpo musculoso con un pecho ancho y una melena distintiva en los machos.",
          "Originario de África e India, se encuentra en sabanas y praderas.",
          "Segunda especie de felino más grande."
        ]
      },
      "lynx": {
        "name": "Lince",
        "binomialNomenclature": "Lynx",
        "info": "Un lince es cualquiera de las cuatro especies actuales (el lince canadiense, el lince ibérico, el lince euroasiático y el bobcat) dentro del género de felinos salvajes de tamaño medio Lynx.<br><br>Los linces tienen una cola corta, mechones de pelo negro muy característicos en las puntas de sus orejas, grandes patas acolchonadas para caminar sobre la nieve y largos bigotes en la cara. Su color varía desde el marrón medio hasta el dorado o blanco-beige, y en ocasiones tiene manchas de color marrón oscuro, especialmente en las extremidades.<br><br>Su peso varía entre los 7,3 a 30 kg (16 a 66 lb) y su longitud de 71 a 129 cm (28 a 51 in). Todas las especies habitan exclusivamente en el Hemisferio Norte, en Eurasia y América del Norte.",
        "clues": [
          "Mechones de pelo negro característicos en las puntas de sus orejas.",
          "Felinos salvajes de tamaño medio, con una variedad de colores de pelaje y manchas ocasionales.",
          "Se encuentran exclusivamente en el Hemisferio Norte, en Eurasia y América del Norte."
        ]
      },
      "ocelot": {
        "name": "Ocelote",
        "binomialNomenclature": "Leopardus pardalis",
        "info": "El ocelote (<i>Leopardus pardalis</i>) es un felino salvaje de tamaño medio con manchas que alcanza de 40 a 50 cm (16 a 20 in) de altura en los hombros y pesa entre 7 y 15.5 kg (15 a 34 lb) de promedio.<br><br>Es originario del suroeste de Estados Unidos, México, América Central y del Sur, y las islas caribeñas de Trinidad y Margarita.<br><br>El pelaje del ocelote está marcadamente cubierto con manchas negras sólidas sobre un fondo color crema, pardo, amarillento, gris rojizo o gris. Las manchas en la cabeza y las extremidades son pequeñas, pero las marcas en la espalda, mejillas y flancos son bandas abiertas o cerradas y rayas. El ocelote es el <strong>miembro más grande del género Leopardus</strong>.",
        "clues": [
          "Felino salvaje de tamaño medio con un patrón de pelaje distintivo, con marcas negras sólidas y manchas.",
          "Se encuentra en las Américas, incluyendo el suroeste de los EE. UU. y partes de América Central y del Sur.",
          "El miembro más grande del género Leopardus."
        ]
      },
      "serval": {
        "name": "Serval",
        "binomialNomenclature": "Leptailurus serval",
        "info": "El serval (<i>Leptailurus serval</i>), cerval o gato serval, es un felino salvaje originario de África. Se encuentra ampliamente distribuido en países del África subsahariana, excepto en las regiones de selva tropical.<br><br>El serval es un felino de tamaño medio y cuerpo delgado que mide de 54 a 62 cm (21 a 24 in) a la altura del hombro y pesa entre 9 y 18 kg (20 a 40 lb). Se caracteriza por su cabeza pequeña, grandes orejas, pelaje de color amarillo dorado a beige, con manchas y rayas negras, y una cola corta con punta negra.<br><br>El serval tiene las <strong>patas más largas en relación con su tamaño corporal de todos los felinos</strong>. Es similar al caracal, pero tiene una huella más estrecha, un cráneo más redondeado y carece de los prominentes mechones en las orejas.",
        "clues": [
          "Felino salvaje originario de África.",
          "Tiene las patas más largas de todos los felinos en relación con el tamaño de su cuerpo.",
          "Similar al caracal simpátrico, pero con huellas más estrechas, un cráneo más redondeado y sin los prominentes mechones en las orejas."
        ]
      },
      "snowLeopard": {
        "name": "Leopardo de las nieves",
        "binomialNomenclature": "Panthera uncia",
        "info": "El leopardo de las nieves (<i>Panthera uncia</i>) o irbis es una especie de gran felino del género Panthera, de la familia de los felinos. Es originario de las cadenas montañosas de Asia Central y del Sur.<br><br>Su pelaje es blanco a gris con manchas negras en la cabeza y el cuello, y rosetas más grandes en el lomo, los flancos y la cola peluda.<br><br>Su hocico es corto, su frente abovedada y sus cavidades nasales son grandes. Son robustos, de patas cortas, y ligeramente más pequeños que otros felinos del género Panthera, con una longitud de cabeza a cuerpo de 75 a 150 cm (30 a 59 in). Su cola mide entre 80 y 105 cm (31 a 41 in) de largo. Su peso varía de 25 kg (55 lb) a 75 kg (165 lb).",
        "clues": [
          "Cuerpo robusto y patas cortas, con grandes cavidades nasales y un hocico corto.",
          "Pelaje blanco a gris con distintivas manchas negras y rosetas.",
          "Originario de las cadenas montañosas de Asia Central y del Sur."
        ]
      },
      "tiger": {
        "name": "Tigre",
        "binomialNomenclature": "Panthera tigris",
        "info": "El tigre (<i>Panthera tigris</i>) es un gran felino y miembro del género Panthera originario de Asia. Tiene un cuerpo poderoso y musculoso, con una gran cabeza y patas, una cola larga y pelaje naranja con rayas negras, mayormente verticales.<br><br>Es la <strong>especie de felino más grande del mundo</strong>, junto con el león, y ambas especies pueden alcanzar tamaños comparables a los de los felinos fósiles más grandes. Sin embargo, las medidas del tigre varían considerablemente entre subespecies: un tigre macho de Sumatra puede pesar hasta 140 kg (308 lb) y alcanzar los 2,3 metros (7 pies 6.5 in), mientras que un tigre de Siberia puede pesar hasta 300 kg (661 lb) y medir hasta 3,3 metros (10 pies 10 in).",
        "clues": [
          "La especie de felino más grande del mundo.",
          "Cuerpo potente y musculoso con patas grandes, una cola larga, y pelaje naranja con rayas negras.",
          "El tamaño y el peso varían considerablemente entre las subespecies."
        ]
      }
    }
  },
  "tictactoe": {},
  "virtualDice": {},
  "wordle": {}
}